In [3]:
s={1,2,3,4,4,5}

In [4]:
s.add(6,7)

TypeError: add() takes exactly one argument (2 given)

In [6]:
list2=[]
for i in range(1,11):
    list2.append(i**2)
print(list2)

[1, 4, 9, 16, 25, 36, 49, 64, 81, 100]

In [8]:
[each**2 for each in range(1,11)if each%2==0]

[4, 16, 36, 64, 100]

In [9]:
[each**2 for each in range(1,11)if each%2!=0]

[1, 9, 25, 49, 81]

In [10]:
['E' if each%2==0 else 'O' for each in range(1,11)]

['O', 'E', 'O', 'E', 'O', 'E', 'O', 'E', 'O', 'E']

In [22]:
list=[-2,-1,0,1,2]
['N' if each < 0 else 'P' if each > 0  else 'Z' for each in list]

['N', 'N', 'Z', 'P', 'P']

In [14]:
print(range(-10,11))

range(-10, 11)

In [23]:
for i in range(-10,11):
    print(i)

-10
-9
-8
-7
-6
-5
-4
-3
-2
-1
0
1
2
3
4
5
6
7
8
9
10

In [26]:
def greet(name):
    print('Hello! ' +name)

In [27]:
greet('Milan')

Hello! Milan

In [2]:
def add(n1,n2):
    print(n1+n2)

In [3]:
add(4,5)

9

In [4]:
def add(*arg):
    print(sum(arg))

In [5]:
add(4,5,6,7)

22

In [6]:
add(2,3,5)

10

In [7]:
add()

0

In [8]:
def add(**arg):
    print(sum(arg))

In [9]:
add(a=2,b=4,c=6)

TypeError: unsupported operand type(s) for +: 'int' and 'str'

### WAF to simulate basic calculator operations.
### WAF to find factor of a positive number.
### WAF to reverse a string.
### WAF to swap two numbers.

In [15]:
 #WAF to simulate basic calculator operations.
    def calculator(n1,n2,op= '+'):
        if op == '+':
            return n1+n2
        elif op == '-':
            return n1-n2
        else:
            return -1

NameError: name 'n1' is not defined

In [34]:
#WAP to reverse a number
def reverse(n1):
    n2=0
    while(n1>0):
        temp=n1%10
        n2=(n2*10)+temp
        n1=n1//10
        return n2

In [36]:
reverse(24)

4

In [38]:
s=lambda a,b,c:a*b-c
s(2,3,5)

1

In [39]:
#map() : it ensures the output length will be same as input length

In [40]:
from functools import reduce

In [53]:
list1=[1,2,3,4,5,6,7,8,9,10]

In [54]:
reduce(lambda x,y:x if x>y else y,list1)

10

In [55]:
reduce(lambda x,y:x-y,list1)

-53

In [59]:
reduce(lambda x,y:len(list1),range(201,300))

10

In [62]:
reduce(lambda x,y:len(range(201,300)))

TypeError: reduce expected at least 2 arguments, got 1

In [66]:
list(map(lambda x:'P' if x>0 else 'N' if x<0 else 'o',range(-10,11)))

['N',
 'N',
 'N',
 'N',
 'N',
 'N',
 'N',
 'N',
 'N',
 'N',
 'o',
 'P',
 'P',
 'P',
 'P',
 'P',
 'P',
 'P',
 'P',
 'P',
 'P']

In [67]:
list(map(lambda x:'P' if x>0 else 'N' if x<0 else 'o',range(-10,11)))

['N',
 'N',
 'N',
 'N',
 'N',
 'N',
 'N',
 'N',
 'N',
 'N',
 'o',
 'P',
 'P',
 'P',
 'P',
 'P',
 'P',
 'P',
 'P',
 'P',
 'P']

In [68]:
gender=['female','male','female','male','female']

In [ ]:
#Practice on 09-12-2020

In [2]:
siam ={'car':['audi','porsche','bmw'],
      'model':[4,8,9]}

In [7]:
siam[2][0]

KeyError: 2

In [8]:
for i in siam.values():
    print(i)

['audi', 'porsche', 'bmw']
[4, 8, 9]

In [10]:
for i in siam.keys():
    print(i)

car
model

In [15]:
list1=set(list(range(1,11)))
list2=set(list(range(1,21)))

In [12]:
list1

{1, 2, 3, 4, 5, 6, 7, 8, 9, 10}

In [14]:
print(type(list1))

<class 'set'>

In [16]:
list2

{1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20}

In [19]:
print(list1.intersection(list2))
list2

{1, 2, 3, 4, 5, 6, 7, 8, 9, 10}

{1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20}

In [22]:
list1.intersection_update(list2)

In [23]:
list2

{1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20}

In [25]:
set((1,2,3))

{1, 2, 3}

In [26]:
[i-j for i in range(1,4) for j in range(2,6)]

[-1, -2, -3, -4, 0, -1, -2, -3, 1, 0, -1, -2]

In [30]:
print('strings'.replace('s','m',2))

mtringm

In [31]:
j= lambda a,b:a+b
j(3,8)

11

In [32]:
list1= list(range(1,11))

In [33]:
list1

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

In [34]:
list(map(lambda x:x+4,list1))

[5, 6, 7, 8, 9, 10, 11, 12, 13, 14]

In [35]:
[x+4 for x in list1]

[5, 6, 7, 8, 9, 10, 11, 12, 13, 14]

In [36]:
def greet(name,strI='hello'):
    print(strI,name,'!')

In [38]:
greet('jyoti')

hello jyoti !

In [39]:
def my_func(x):
    return(x,5*x)

In [40]:
my_func(5)

(5, 25)

In [42]:
print(type(my_func))

<class 'function'>

In [43]:
def fact(x):
    return lambda n:x**n
fobj=fact(4)
print(fobj(3))

64

In [48]:
n=int(input('Enter the number'))
sum1=0
for i in range(1,n):
    if(n%i==0):
        sum1=sum1+i
print(sum1)
if(sum1==n):
    print('the number {} is a perfect number',n)
else:
    print('the number {} is not a perfect number',n)

Enter the number6
6
the number {} is a perfect number 6

In [1]:
n=input('enter the number')

enter the number4

In [4]:
n=eval('2+3')
n

5

In [6]:
import sys
sys.path

['C:\\Users\\milan.naik\\Downloads\\Temp\\Python',
 'C:\\Users\\milan.naik\\Anaconda3\\python38.zip',
 'C:\\Users\\milan.naik\\Anaconda3\\DLLs',
 'C:\\Users\\milan.naik\\Anaconda3\\lib',
 'C:\\Users\\milan.naik\\Anaconda3',
 '',
 'C:\\Users\\milan.naik\\Anaconda3\\lib\\site-packages',
 'C:\\Users\\milan.naik\\Anaconda3\\lib\\site-packages\\win32',
 'C:\\Users\\milan.naik\\Anaconda3\\lib\\site-packages\\win32\\lib',
 'C:\\Users\\milan.naik\\Anaconda3\\lib\\site-packages\\Pythonwin',
 'C:\\Users\\milan.naik\\Anaconda3\\lib\\site-packages\\IPython\\extensions',
 'C:\\Users\\milan.naik\\.ipython']

In [7]:
15%4

3

In [8]:
15//4

3

In [1]:
# Class 19-12-2020

In [5]:
import pandas as pd
import numpy as np

In [4]:
import sqlite3
conn= sqlite3.connect('test.db')
sql_query = '''SELECT * FROM test.table1 LIMIT 100;'''
print("Table  created successfully")
returned_df = pd.read_sql_query(sql=sql_query,con=conn)
conn.close()

Table  created successfully

DatabaseError: Execution failed on sql 'SELECT * FROM test.table1 LIMIT 100;': no such table: test.table1

In [6]:
ipl_data = {'Team': ['Riders', 'Riders', 'Devils', 'Devils', 'Kings', 'kings', 'Kings', 'Kings', 'Riders', 'Royals', 'Royals', 'Riders'], 
                'Rank': [1, 2, 2, 3, 3,4 ,1 ,1,2 , 4,1,2],
                'Year': [2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],
                'Points':[876,789,863,673,741,812,756,788,694,701,804,690]}
df = pd.DataFrame(ipl_data)
df

      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
2   Devils     2  2014     863
3   Devils     3  2015     673
4    Kings     3  2014     741
5    kings     4  2015     812
6    Kings     1  2016     756
7    Kings     1  2017     788
8   Riders     2  2016     694
9   Royals     4  2014     701
10  Royals     1  2015     804
11  Riders     2  2017     690

In [7]:
df.Points

0     876
1     789
2     863
3     673
4     741
5     812
6     756
7     788
8     694
9     701
10    804
11    690
Name: Points, dtype: int64

In [8]:
df[['Points','Rank']]

    Points  Rank
0      876     1
1      789     2
2      863     2
3      673     3
4      741     3
5      812     4
6      756     1
7      788     1
8      694     2
9      701     4
10     804     1
11     690     2

In [9]:
df

      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
2   Devils     2  2014     863
3   Devils     3  2015     673
4    Kings     3  2014     741
5    kings     4  2015     812
6    Kings     1  2016     756
7    Kings     1  2017     788
8   Riders     2  2016     694
9   Royals     4  2014     701
10  Royals     1  2015     804
11  Riders     2  2017     690

In [14]:
df.loc([[1,2,3],[1,2,3]])

TypeError: unhashable type: 'list'

In [15]:
df

      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
2   Devils     2  2014     863
3   Devils     3  2015     673
4    Kings     3  2014     741
5    kings     4  2015     812
6    Kings     1  2016     756
7    Kings     1  2017     788
8   Riders     2  2016     694
9   Royals     4  2014     701
10  Royals     1  2015     804
11  Riders     2  2017     690

In [16]:
df.loc[0:3,'Team':'Team']

     Team
0  Riders
1  Riders
2  Devils
3  Devils

In [17]:
df.loc[0:3,0:1]

TypeError: cannot do slice indexing on Index with these indexers [0] of type int

In [18]:
df.loc[0:3,'Team':'Rank']

     Team  Rank
0  Riders     1
1  Riders     2
2  Devils     2
3  Devils     3

In [19]:
df.loc[0:3,['Team','Rank']]

     Team  Rank
0  Riders     1
1  Riders     2
2  Devils     2
3  Devils     3

In [20]:
df.iloc[0:3,0:1]

     Team
0  Riders
1  Riders
2  Devils

In [21]:
df.loc[6,'Year']

2016

In [22]:
df

      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
2   Devils     2  2014     863
3   Devils     3  2015     673
4    Kings     3  2014     741
5    kings     4  2015     812
6    Kings     1  2016     756
7    Kings     1  2017     788
8   Riders     2  2016     694
9   Royals     4  2014     701
10  Royals     1  2015     804
11  Riders     2  2017     690

In [7]:
df['new_col']=0
df

      Team  Rank  Year  Points  new_col
0   Riders     1  2014     876        0
1   Riders     2  2015     789        0
2   Devils     2  2014     863        0
3   Devils     3  2015     673        0
4    Kings     3  2014     741        0
5    kings     4  2015     812        0
6    Kings     1  2016     756        0
7    Kings     1  2017     788        0
8   Riders     2  2016     694        0
9   Royals     4  2014     701        0
10  Royals     1  2015     804        0
11  Riders     2  2017     690        0

In [8]:
df['diff_elem_by_2']= df.Points- 2
df['avg_points']= np.mean(df.Points)
df['max_points']= np.max(df.Points)
df['min_points']= np.min(df.Points)
df['std_points']= np.std(df.Points)
df['count_points']= np.count(df.Points)

AttributeError: module 'numpy' has no attribute 'count'

In [2]:
df['diff_elem_by_2']= df.Points- 2
df['avg_points']= np.mean(df.Points)
df['min_points']= np.min(df.Points)
df['count_points']= df.Points.count()
df

NameError: name 'df' is not defined

In [10]:
df.drop('new_col',axis=1)

,Team,Rank,Year,Points,diff_elem_by_2,avg_points,max_points,min_points,std_points
0,Riders,1,2014,876,874,765.583333,876,673,64.960832
1,Riders,2,2015,789,787,765.583333,876,673,64.960832
2,Devils,2,2014,863,861,765.583333,876,673,64.960832
3,Devils,3,2015,673,671,765.583333,876,673,64.960832
4,Kings,3,2014,741,739,765.583333,876,673,64.960832
5,kings,4,2015,812,810,765.583333,876,673,64.960832
6,Kings,1,2016,756,754,765.583333,876,673,64.960832
7,Kings,1,2017,788,786,765.583333,876,673,64.960832
8,Riders,2,2016,694,692,765.583333,876,673,64.960832
9,Royals,4,2014,701,699,765.583333,876,673,64.960832
10,Royals,1,2015,804,802,765.583333,876,673,64.960832
11,Riders,2,2017,690,688,765.583333,876,673,64.960832

In [11]:
df.drop(8,axis=0)

,Team,Rank,Year,Points,new_col,diff_elem_by_2,avg_points,max_points,min_points,std_points
0,Riders,1,2014,876,0,874,765.583333,876,673,64.960832
1,Riders,2,2015,789,0,787,765.583333,876,673,64.960832
2,Devils,2,2014,863,0,861,765.583333,876,673,64.960832
3,Devils,3,2015,673,0,671,765.583333,876,673,64.960832
4,Kings,3,2014,741,0,739,765.583333,876,673,64.960832
5,kings,4,2015,812,0,810,765.583333,876,673,64.960832
6,Kings,1,2016,756,0,754,765.583333,876,673,64.960832
7,Kings,1,2017,788,0,786,765.583333,876,673,64.960832
9,Royals,4,2014,701,0,699,765.583333,876,673,64.960832
10,Royals,1,2015,804,0,802,765.583333,876,673,64.960832
11,Riders,2,2017,690,0,688,765.583333,876,673,64.960832

In [15]:
df[df.Team =='Riders']

,Team,Rank,Year,Points,new_col,diff_elem_by_2,avg_points,max_points,min_points,std_points
0,Riders,1,2014,876,0,874,765.583333,876,673,64.960832
1,Riders,2,2015,789,0,787,765.583333,876,673,64.960832
8,Riders,2,2016,694,0,692,765.583333,876,673,64.960832
11,Riders,2,2017,690,0,688,765.583333,876,673,64.960832

In [20]:
df[df.Team == ('Riders','Royals')]

Empty DataFrame
Columns: [Team, Rank, Year, Points, new_col, diff_elem_by_2, avg_points, max_points, min_points, std_points]
Index: []

In [25]:
df.Team ==('Riders'|'Royals')

TypeError: unsupported operand type(s) for |: 'str' and 'str'

In [26]:
(df.Team == 'Royals') | (df.Team == 'Riders')

0      True
1      True
2     False
3     False
4     False
5     False
6     False
7     False
8      True
9      True
10     True
11     True
Name: Team, dtype: bool

 select 'Team' = 'Riders'
2. Select all the records for Team Royals or Team Riders
3. Select all the records where Year is either 2017 or 2016
4. select column 'Team' who played in the year 2017 or 2016
5. Select all the Teams with Rank above 2

In [27]:
df[df.Team.notin(['Royals','Riders'])]

AttributeError: 'Series' object has no attribute 'notin'

In [29]:
df[df['Year'].isin([2016,2017])]

,Team,Rank,Year,Points,new_col,diff_elem_by_2,avg_points,max_points,min_points,std_points
6,Kings,1,2016,756,0,754,765.583333,876,673,64.960832
7,Kings,1,2017,788,0,786,765.583333,876,673,64.960832
8,Riders,2,2016,694,0,692,765.583333,876,673,64.960832
11,Riders,2,2017,690,0,688,765.583333,876,673,64.960832

In [33]:
df[df['Year'].isin([2017,2016])]['Team']

6      Kings
7      Kings
8     Riders
11    Riders
Name: Team, dtype: object

In [35]:
df[df.Rank>2]

,Team,Rank,Year,Points,new_col,diff_elem_by_2,avg_points,max_points,min_points,std_points
3,Devils,3,2015,673,0,671,765.583333,876,673,64.960832
4,Kings,3,2014,741,0,739,765.583333,876,673,64.960832
5,kings,4,2015,812,0,810,765.583333,876,673,64.960832
9,Royals,4,2014,701,0,699,765.583333,876,673,64.960832

In [36]:
df.head()

,Team,Rank,Year,Points,new_col,diff_elem_by_2,avg_points,max_points,min_points,std_points
0,Riders,1,2014,876,0,874,765.583333,876,673,64.960832
1,Riders,2,2015,789,0,787,765.583333,876,673,64.960832
2,Devils,2,2014,863,0,861,765.583333,876,673,64.960832
3,Devils,3,2015,673,0,671,765.583333,876,673,64.960832
4,Kings,3,2014,741,0,739,765.583333,876,673,64.960832

In [37]:
df.tail()

,Team,Rank,Year,Points,new_col,diff_elem_by_2,avg_points,max_points,min_points,std_points
7,Kings,1,2017,788,0,786,765.583333,876,673,64.960832
8,Riders,2,2016,694,0,692,765.583333,876,673,64.960832
9,Royals,4,2014,701,0,699,765.583333,876,673,64.960832
10,Royals,1,2015,804,0,802,765.583333,876,673,64.960832
11,Riders,2,2017,690,0,688,765.583333,876,673,64.960832

In [38]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 10 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Team            12 non-null     object
 1   Rank            12 non-null     int64
 2   Year            12 non-null     int64
 3   Points          12 non-null     int64
 4   new_col         12 non-null     int64
 5   diff_elem_by_2  12 non-null     int64
 6   avg_points      12 non-null     float64
 7   max_points      12 non-null     int64
 8   min_points      12 non-null     int64
 9   std_points      12 non-null     float64
dtypes: float64(2), int64(7), object(1)
memory usage: 1.1+ KB

In [39]:
df.describe()

,Rank,Year,Points,new_col,diff_elem_by_2,avg_points,max_points,min_points,std_points
count,12.000000,12.000000,12.000000,12.0,12.000000,12.000000,12.0,12.0,1.200000e+01
mean,2.166667,2015.166667,765.583333,0.0,763.583333,765.583333,876.0,673.0,6.496083e+01
std,1.114641,1.114641,67.849376,0.0,67.849376,0.000000,0.0,0.0,1.484275e-14
min,1.000000,2014.000000,673.000000,0.0,671.000000,765.583333,876.0,673.0,6.496083e+01
25%,1.000000,2014.000000,699.250000,0.0,697.250000,765.583333,876.0,673.0,6.496083e+01
50%,2.000000,2015.000000,772.000000,0.0,770.000000,765.583333,876.0,673.0,6.496083e+01
75%,3.000000,2016.000000,806.000000,0.0,804.000000,765.583333,876.0,673.0,6.496083e+01
max,4.000000,2017.000000,876.000000,0.0,874.000000,765.583333,876.0,673.0,6.496083e+01

In [42]:
df.sort_values('Team', ascending =True )

,Team,Rank,Year,Points,new_col,diff_elem_by_2,avg_points,max_points,min_points,std_points
2,Devils,2,2014,863,0,861,765.583333,876,673,64.960832
3,Devils,3,2015,673,0,671,765.583333,876,673,64.960832
4,Kings,3,2014,741,0,739,765.583333,876,673,64.960832
6,Kings,1,2016,756,0,754,765.583333,876,673,64.960832
7,Kings,1,2017,788,0,786,765.583333,876,673,64.960832
0,Riders,1,2014,876,0,874,765.583333,876,673,64.960832
1,Riders,2,2015,789,0,787,765.583333,876,673,64.960832
8,Riders,2,2016,694,0,692,765.583333,876,673,64.960832
11,Riders,2,2017,690,0,688,765.583333,876,673,64.960832
9,Royals,4,2014,701,0,699,765.583333,876,673,64.960832
10,Royals,1,2015,804,0,802,765.583333,876,673,64.960832
5,kings,4,2015,812,0,810,765.583333,876,673,64.960832

In [43]:
df.describe()

AttributeError: 'DataFrame' object has no attribute 'summary'

In [44]:
df.Team.unique()

array(['Riders', 'Devils', 'Kings', 'kings', 'Royals'], dtype=object)

In [45]:
df.Team.nunique()

5

In [47]:
df.columns

Index(['Team', 'Rank', 'Year', 'Points', 'new_col', 'diff_elem_by_2',
       'avg_points', 'max_points', 'min_points', 'std_points'],
      dtype='object')

In [48]:
df.shape

(12, 10)

In [49]:
df

,Team,Rank,Year,Points,new_col,diff_elem_by_2,avg_points,max_points,min_points,std_points
0,Riders,1,2014,876,0,874,765.583333,876,673,64.960832
1,Riders,2,2015,789,0,787,765.583333,876,673,64.960832
2,Devils,2,2014,863,0,861,765.583333,876,673,64.960832
3,Devils,3,2015,673,0,671,765.583333,876,673,64.960832
4,Kings,3,2014,741,0,739,765.583333,876,673,64.960832
5,kings,4,2015,812,0,810,765.583333,876,673,64.960832
6,Kings,1,2016,756,0,754,765.583333,876,673,64.960832
7,Kings,1,2017,788,0,786,765.583333,876,673,64.960832
8,Riders,2,2016,694,0,692,765.583333,876,673,64.960832
9,Royals,4,2014,701,0,699,765.583333,876,673,64.960832
10,Royals,1,2015,804,0,802,765.583333,876,673,64.960832
11,Riders,2,2017,690,0,688,765.583333,876,673,64.960832

In [50]:
df.apply('mean')

Rank                 2.166667
Year              2015.166667
Points             765.583333
new_col              0.000000
diff_elem_by_2     763.583333
avg_points         765.583333
max_points         876.000000
min_points         673.000000
std_points          64.960832
dtype: float64

In [51]:
df.groupby('Team').groups

{'Devils': [2, 3], 'Kings': [4, 6, 7], 'Riders': [0, 1, 8, 11], 'Royals': [9, 10], 'kings': [5]}

In [52]:
df.groupby('Team')['Points'].mean()

Team
Devils    768.000000
Kings     761.666667
Riders    762.250000
Royals    752.500000
kings     812.000000
Name: Points, dtype: float64

In [53]:
df.groupby(['Team','Year'])[['Points']].mean()

             Points
Team   Year
Devils 2014     863
       2015     673
Kings  2014     741
       2016     756
       2017     788
Riders 2014     876
       2015     789
       2016     694
       2017     690
Royals 2014     701
       2015     804
kings  2015     812

In [54]:
df.groupby('Team')['Points','Rank'].mean().reset

<ipython-input-54-269d35fec7e2>:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  df.groupby('Team')['Points','Rank'].mean()

            Points      Rank
Team
Devils  768.000000  2.500000
Kings   761.666667  1.666667
Riders  762.250000  1.750000
Royals  752.500000  2.500000
kings   812.000000  4.000000

In [1]:
print(greet.__doc__)

    This function greets to
    the person passed in as
    a parameter

IndentationError: unexpected indent (<ipython-input-1-b18af1fe18fd>, line 3)

In [9]:
my_list=[1,3,4,5,6,7]
new_list1=list(filter(lambda x: x%2==0,my_list))
print(new_list1)
new_list2=list(map(lambda x: x * 2,my_list))
print(new_list2)

[4, 6]
[2, 6, 8, 10, 12, 14]

In [10]:
dir()

['In',
 'Out',
 '_',
 '_4',
 '_6',
 '_7',
 '_8',
 '__',
 '___',
 '__builtin__',
 '__builtins__',
 '__doc__',
 '__loader__',
 '__name__',
 '__package__',
 '__spec__',
 '_dh',
 '_i',
 '_i1',
 '_i10',
 '_i2',
 '_i3',
 '_i4',
 '_i5',
 '_i6',
 '_i7',
 '_i8',
 '_i9',
 '_ih',
 '_ii',
 '_iii',
 '_oh',
 'exit',
 'get_ipython',
 'my_list',
 'new_list',
 'new_list1',
 'new_list2',
 'quit']

In [1]:
my_list=['p','r','o','b','l','e','m']

In [2]:
print(my_list[-1])

m

In [3]:
print(my_list[2:5])

['o', 'b', 'l']

In [4]:
print(my_list[:-5])

['p', 'r']

In [5]:
print(my_list[5:])

['e', 'm']

In [6]:
odd=[1,3,5]

In [8]:
odd.append(7)
print(odd)

[1, 3, 5, 7]

In [10]:
odd.extend([8,11,12])
print(odd)

[1, 3, 5, 7, 8, 11, 12, 8, 11, 12]

In [12]:
odd.insert(5,9)
print(odd)

[1, 3, 5, 7, 8, 9, 9, 11, 12, 8, 11, 12]

In [13]:
'Hello ' 'World!'

'Hello World!'

In [14]:
my_set = {1,3}
print(my_set)

{1, 3}

In [15]:
my_set.add(2)

In [16]:
print(my_set)

{1, 2, 3}

In [17]:
import pandas as pd 
left_df = pd.DataFrame({ 'id':[1,2,3,4,5],
          'Name': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung'],
                      'subject_id':['sub1','sub2','sub4','sub6','sub5']}
right_df = pd.DataFrame( {'id':[1,2,3,4,5],
          'Name': ['Billy', 'Brian', 'Bran', 'Bryce','Betty'],
                           'subject_id':['sub2','sub4','sub3','sub6','sub5']})

SyntaxError: invalid syntax (<ipython-input-17-f683556fea33>, line 5)

In [1]:
print('strings'.replace())

TypeError: replace expected at least 2 arguments, got 0

In [2]:
a=[1,2,3,4]
a.reverse()
a

[4, 3, 2, 1]

In [3]:
def reverse_string(in_str):
    '''Reverse a given string.
    in_str -> should be string'''
    blank_list = []
    blank_list.extend(in_str)
    return "".join(blank_list[::-1])

In [4]:
reverse_string('newtown')

'nwotwen'

In [8]:
a=[]
b= a.extend('newtown')
print(b)

None

In [11]:
list1 = list(range(1,11))

In [12]:
list1

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

In [14]:
list(filter(lambda x: x%2== 0, list1))

[2, 4, 6, 8, 10]

In [15]:
def add(num1,num2=3):
    print(num1+num2)

In [16]:
add(1)

4

In [17]:
add(1,2)

3

In [18]:
file = open('code.txt',mode = 'a')  # open a file in 'w' 
file.write("This is the 1st line.\nThis is 2nd line")
# file.write("This is the 1st  line.\nThis is 2nd line")
file.close()

In [19]:
file = open('code.txt',mode = 'a')  # open a file in 'w' 
file.write("This is the 3rd line.\nThis is 2nd line")
# file.write("This is the 1st  line.\nThis is 2nd line")
file.close()

In [20]:
file = open('code.txt',mode = 'a')  # open a file in 'w' 
file.writelines(["\nThis is the 5th line.",'\nThis is 6th line.','\nThis is 7th line'])
file.close()

In [21]:
with open('code.txt',mode = 'a') as file:
    file.writelines(["\nThis is the 5th line.",'\nThis is 6th line.','\nThis is 7th line'])

In [23]:
with open('code.txt',mode = 'r') as file:
    print(file.read())

This is the 1st line.
This is 2nd lineThis is the 3rd line.
This is 2nd line
This is the 5th line.
This is 6th line.
This is 7th line
This is the 5th line.
This is 6th line.
This is 7th line

In [25]:
with open('code.txt',mode = 'a') as file:
    file.truncate(30)
    file.close()

In [27]:
with open('code.txt',mode = 'r') as file:
    print(file.read())

This is the 1st line.
This is

In [28]:
try:
    n1=int(input())
    n2=int(input())
    res = n1%n2
    print('result of above operation is {}'.format(res))
except:
    print('Invalid input')

3
5
result of above operation is 3

In [29]:
import re

In [30]:
re.split(pattern= ' ', string = "My name is Antony Gonsalvez" )

['My', 'name', 'is', 'Antony', 'Gonsalvez']

In [32]:
print(re.search('is',string = 'My name is Antony Gonsalvez'))

<re.Match object; span=(8, 10), match='is'>

In [ ]:
re.search()